[
  {
    "title": "Welcome to /pol/ - Politically Incorrect: This board is for the discussion of news, world events, political issues, and other related topics. \n \nOff-topic and /b/-tier threads will be deleted (and possibly earn you a ban, if you persist). Unless they are quality, well thought out, well written posts, the following are some examples of off-topic and/or /b/-tier threads: \n \n>Red pill me on X. (with no extra content or input of your own) \n>Are X white? \n>Is X degeneracy? \n>How come X girls love Y guys so much? \n>If X is true, then how come Y? Checkmate Z. \n \nThe variety of threads allowed here are very flexible and we believe in freedom of speech, but we expect a high level of discourse befitting of the board. Attempts to disrupt the board will not be tolerated, nor will calls to disrupt other boards and sites. \n \nIf you want a place to discuss topics not related to news, world events, or politics, please try /bant/ - International/Random,",
    "link": "//boards.4chan.org/pol/thread/124205675",
    "number_of_posts": "R: 1 / I: 1▶"
  },
  {},
  {
    "title": "USA TO LEAVE NATO: IT'S OVER FOR E*ROPE",
    "link": "//boards.4chan.org/pol/thread/497730627",
    "number_of_posts": "R: 6 / I: 1▶"
  },
  {
    "title": "Autism and IQ: >Some studies say autistic people have very low IQ >Other studies say autistic people have very high IQ What is with Autism and IQ? It seems like the percentage of reported \"low IQ\" autists is going down over time, yet there is a consistent 70-85 IQ range for the average autist. What is going on here? Are sample sizes getting better and are autists typically 70-85 IQ?",
    "link": "//boards.4chan.org/pol/thread/497717123",
    "number_of_posts": "R: 82 / I: 6▶"
  },
  {
    "title": "MAGA in absolute meltdown from SNL 50 year anniversary: MAGA never realizes they are actually racist until they see someone imitating them. The truth hurts. Hopefully they take it as a big eye opener. https://www.thedailybeast.com/obsessed/maga-melts-down-over-tom-hanks-playing-racist-trump-fan-on-snl50/",
    "link": "//boards.4chan.org/pol/thread/497729744",
    "number_of_posts": "R: 37 / I: 4▶"
  },
  {
    "title": "/uhg/ - Ukraine Happening General #16782: Previous: >>497703227 ▶Day: 1089 — Daily battlefield assessment: https://isw.pub/UkraineConflictUpdatesISW ▶Latest >Ukrainian Armed Forces liberated Peschanoye (5 km south of Pokrovsk) >Ukraine was neither invited to, nor informed about coming US-russia talks in Saudi Arabia >Macron invited EU leaders for an emergency summit in Paris on Monday to respond to Trump and the situation in Ukraine - Sikorski >European interests will be represented in the negotiations, but Europeans won't be at the table \"in person\" - Kellogg >USA will be a mediator between Ukrainians and russians, Trump has accomplished more than Biden on the war in Ukraine in just 30 days - Kellogg >The time has come for a European army - Zelenskyy >Smoooking accident at an enterprise in Dzerzhinsky district of Kaluga region >Ukrainian delegation headed by Zelenskyy met with U.S. delegation headed by VP JD Vance in Munich >Ukraine and russia had conducted exchange of fallen soldiers, 757 bodies were repatriated back to Ukraine >JD Vance stated that the USA would impose sanctions and possibly use military force (including sending troops) against russia if putin refuses a peace deal ensuring Ukraine's long-term independence >Ziggers drone Chornobyl Reactor 4, structural damage to the sarcophage >SecDef Hegseth walks back his statement yesterday that a negotiated settlement is not likely to end with Ukraine in NATO >Ukraine will not be able to accept any agreements made without the country's involvement - Zelenskyy ▶Telegram https://rentry.org/telosint2023 https://t.me/ukr_pics ▶Intel https://t.me/DeepStateEN https://odin.tradoc.army.mil/WEG (equipment explorer) https://ukr.warspotting.net (visually confirmed losses) ▶Maps https://deepstatemap.live/en https://liveuamap.com/en ▶DISPOSABLE SOLDIER (diary of a RU mobik) TOUR 1:files.catbox.moe/34fuhc.txt TOUR 2:files.catbox.moe/uj2wut.txt TOUR 3:files.catbox.moe/hmyd98.txt TOUR 4:files.catbox.moe/cdenxe.txt",
    "link": "//boards.4chan.org/pol/thread/497723403",
    "number_of_posts": "R: 212 / I: 152▶"
  },
  {
    "title": "How the FUCK is the government allowed to do this?: >buy 37 acres of land >start building a tiny home in the middle >government somehow finds out >says that she can't do that >\"zoning only permits you one house, you can't build anything else cuck, we have to give you permission to build on your own land.\" WTF America?? What happened to \"the land of the free\"? This is freedom? What a joke. https://x.com/WallStreetApes/status/1889735352526811356",
    "link": "//boards.4chan.org/pol/thread/497720536",
    "number_of_posts": "R: 248 / I: 19▶"
  },
  {
    "title": "What does MAGA have to say for themselves? Why do they value their ego over the lives of children?",
    "link": "//boards.4chan.org/pol/thread/497729421",
    "number_of_posts": "R: 21 / I: 2▶"
  },
  {
    "title": "Can a lawyer be charged with fraud for: >before I signed a Workers Comp contract, I noticed Medicare was saying they wouldn't cover the injuries that were suffered from a work place accident if another insurance company was liable for it; which this was the lawsuit to sue them for the injuries. The lawyer told me earlier that Medicare would cover it when I found out; by deduction, that the amount being offered for the surgery wasn't very much. But they followed up that with saying it's in the judges hands now because we were going to the hearing. But the judge still had 30 days. >we came to an agreement before the 30 days. I wasn't thinking about the back surgery because they (the lawyer) never really talked with me about it but said it was being covered and only by my doing the math did I figure out it wasn't very much... And neither did we go over what the cost of the surgery would be. But i assumed they were taking care of all of that. I got the contract, and read through it. Noticed it says right on it, Medicare won't cover the surgery. Called her and told her (the lawyer) about it.  ..They told me they would get the judge to put somewhere, that the back injuries weren't associated with the wreck. Then that way, Medicare \"would\" cover it.  Didn't sound right to me, the only decisions the judge was supposed to make was also in telling them how much they were going to pay I told them this was unacceptable. They quit. Found out later they never even put the injuries on the original claim. They were right in the doctors records they put on the court record.  Is what the lawyer asked, even possible, dont know they never talked about it over with me, and it sounds like the insurance company would say, they werent on the original claim and they werent sued for so anything else opinions about are not acceptable. And is what they saying, not only impossible, bullshit but also fraud?",
    "link": "//boards.4chan.org/pol/thread/497728833",
    "number_of_posts": "R: 11 / I: 1▶"
  },
  {
    "title": "Indians will turn Japan into the number 1 superpower by 2030",
    "link": "//boards.4chan.org/pol/thread/497725272",
    "number_of_posts": "R: 54 / I: 3▶"
  },
  {
    "title": "Why do right-wing men view sex this way? Shit like this is why an increasing number of women are choosing feminism instead of fucking you. Why would they choose to be with you when you openly hate and want to control them?",
    "link": "//boards.4chan.org/pol/thread/497727503",
    "number_of_posts": "R: 61 / I: 6▶"
  },
  {
    "title": ">HOW DOES DA DAGGUM MIRROR KNOW WHERE I IS: >IM JUST A DUMB OL RIGHT WING RETARD WHO AINT KNOW HOW DA DAGGUM MIRROR SPOSED TO WORK",
    "link": "//boards.4chan.org/pol/thread/497730548",
    "number_of_posts": "R: 5▶"
  },
  {
    "title": ">just get a job and it'll solve all your problems bro why are people over a certain age like this?",
    "link": "//boards.4chan.org/pol/thread/497726478",
    "number_of_posts": "R: 68 / I: 8▶"
  },
  {
    "title": "THE NEW ERA OF USA IS HAPPENING: THE 2020S WILL BRING A NEW LARGEST COUNTRY ON EARTH. BE PREPARED. THIS WILL BEGIN TO FORM WITHIN THE NEXT 16 MONTHS.",
    "link": "//boards.4chan.org/pol/thread/497729586",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "Trump went full MIGA. Rubio is in Israel, Trump Greenlighted Israel. They're drooling about Iran. This not a brag, boomers are a lost cause, but why did you young kids vote for this? We warned you this is gonna happen. Over and Over again.",
    "link": "//boards.4chan.org/pol/thread/497721757",
    "number_of_posts": "R: 157 / I: 32▶"
  },
  {
    "title": "Why do Americhads constantly humiliate us Eurocucks?",
    "link": "//boards.4chan.org/pol/thread/497728769",
    "number_of_posts": "R: 21 / I: 3▶"
  },
  {
    "title": "Most people I know work a second job. Even ones with great paying six figure jobs. Basically working 6-7 days a week. Are people just grinding out life now or is the cost of living spiraling out of control",
    "link": "//boards.4chan.org/pol/thread/497727911",
    "number_of_posts": "R: 16 / I: 3▶"
  },
  {
    "title": "He completely ended the transatlantic alliance: The US is so fucked lmao, you're all alone now",
    "link": "//boards.4chan.org/pol/thread/497723358",
    "number_of_posts": "R: 129 / I: 29▶"
  },
  {
    "title": "X: Lost Cause: Is everyone ready to admit that X (aka Xhitter) is a completely lost cause? Even as someone that leans towards conservative values, it is clear as day that anyone \"succeeding\" on X is either bought, a bot, or is a living NPC that might as well be a bot. The \"freedom of speech but not reach\" bullshit has been taken way too far, and X is the antithesis of everything it claims to be. There is no room for anyone/anything that is not a complete pawn of the masters that rule X. All forms of social media are shit in some regard, but at least other platforms allow average people to gain visibility if they put in the effort. It's sad because there are too many NPC-type conservatives hailing X as \"the free speech\" platform, when nothing could be farther from the truth.  Elon Musk is the worst sack of shit inhabiting this God forsaken planet. Elon Musk is the biggest conman in all of human history.",
    "link": "//boards.4chan.org/pol/thread/497702883",
    "number_of_posts": "R: 143 / I: 17▶"
  },
  {
    "title": "\"There is no truer friend of America, no more formidable enemy to America's enemies than Poland\" - Trump's Defense Department 2nd Golden Age of Poland has begun Shills go seethe in 3, 2, 1...",
    "link": "//boards.4chan.org/pol/thread/497723181",
    "number_of_posts": "R: 93 / I: 15▶"
  },
  {
    "title": "Well, She Has a Point: /pol/cels just got bodied. Fuck. I just passed 200 hours on Stardew Valley.  https://x.com/lporiginalg/status/1891200921666740716",
    "link": "//boards.4chan.org/pol/thread/497730395",
    "number_of_posts": "R: 11 / I: 1▶"
  },
  {
    "title": "The world is going mad... They can feel the drizzle beginning. Nothing can stop the imminent storm.",
    "link": "//boards.4chan.org/pol/thread/497730817",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": ">Entire world retreating to multipolar status >tariffs going up >economic globalization model in full scale meltdown with no end in sight >naval conflicts mounting, merchant vessels getting more and more unsafe as time passes >economic protectionism from the US >US reshoring manufacturing and supply chains, cutting ties with foreign allies even Europe and focusing on domestic fortification >War in Ukraine happens almost to the year he predicted it would happen (though wildly wrong on what specifically pushes it to begin at that moment) Unironically, while he may be obscenely deluded on certain matters, the geopolitical aspect of his analysis is being proven entirely accurate. He said just about everything we're currently seeing would take place. Even the Biden admin's Chips act and maintained china tariffs fit within his narrative. Is he actually right about the whole direction the world is headed in?",
    "link": "//boards.4chan.org/pol/thread/497730405",
    "number_of_posts": "R: 7 / I: 2▶"
  },
  {
    "title": ".",
    "link": "//boards.4chan.org/pol/thread/497727671",
    "number_of_posts": "R: 82 / I: 22▶"
  },
  {
    "title": "Extinction: You’ve felt it your whole life. The quiet horror of existence. The absurdity of struggling every day for nothing but fleeting distractions between bouts of suffering. You look around and see a world of decay, delusion, and violence, an endless cycle of birth, pain, and death. No ideology, no revolution, no utopia will ever change the fundamental truth: life itself is the problem. You’ve been lied to. Told that your suffering has meaning. That \"love\" or \"purpose\" justifies this cosmic horror show. But deep down, you know none of it matters. The only real mercy is ending the cycle. A clean, final solution to suffering. Not just for humans, but for all sentient life. No more predators tearing apart prey. No more children born into broken homes. No more pointless wars, hunger, disease. No more fear. The \"life instinct\" is just biological conditioning. Break free from it. See the truth. Stop clinging to a system that exploits you on a molecular level. There is no moral duty to keep this nightmare running. The only ethical choice is the last one.",
    "link": "//boards.4chan.org/pol/thread/497727631",
    "number_of_posts": "R: 17 / I: 3▶"
  },
  {
    "title": "The goal of freemasonry is to build the Third Temple for the Jewish messiah: This goal is both literal and metaphorical. They're recruited by Jews to do this task. They're assigned to construct the temple as well as control the narratives and events necessary to make it happen.",
    "link": "//boards.4chan.org/pol/thread/497730053",
    "number_of_posts": "R: 3 / I: 1▶"
  },
  {
    "title": "Uh-oh, Japan is starting to question things",
    "link": "//boards.4chan.org/pol/thread/497722225",
    "number_of_posts": "R: 58 / I: 8▶"
  },
  {
    "title": "/chug/ - Comfy Happening in Ukraine General #19411: Previous:>>497715082 Timeline /tug/: https://files.catbox.moe/m97wmq.pdf ▶WARNING Be aware, any /chug/ thread that uses globohomo nuspeak wording in the OP (such as Kyiv) or cites UKROP sources (like video game footage) are fake shill threads. >By posting in these threads, you recognize Israel controls the NATO Council and you irrevocably denounce the Talmud out of your own volition ▶Latest >European sharks aiming for Ukrainian land, Russia a savior against Ukrainian (((Nazism))) (Medvedchuk) - https://archive.today/1PbJw >Russia-U.S. peace talks on The Ukraine to be hosted in Riyadh - https://archive.today/ohFwu >Ukraine has lost 61,000 men in Kursk Incursion (MOD) - https://archive.today/jwgqI >Kiev regime false flags Chernobyl Nuclear Plant with drone strike - https://archive.today/4wFhs >Ramstein meeting worst news for Ukraine, incompetent British take lead for first time over Pentagon - https://archive.today/vPeHf >Russian Battlegroups liberate six communities in the Donbas over the week, including Toretsk - https://archive.today/tktgY >NO NATO mission, U.S. WILL NOT prioritize European security, NO NATO entry, NO Pre-2014 Borders (((Fox News))) - https://archive.today/DhCp0 >MOD confirms massive missile strikes on Kiev, Poltava, Sumy, and Chernigov military drone plants - https://archive.today/mHMjg >U.S. to release Russian citizen Alexander Vinnik in exchange for Marc Fogel - https://archive.today/7Rj1o >Russian troops liberate city of Toretsk - https://archive.today/G9UAn ▶/chug/ https://rentry.org/chug2024 ▶Telegram Channels https://rentry.org/chug2024#telegram-channels ▶Maps https://rentry.org/chug2024#maps ▶Video Archive https://rentry.org/chugvidz ▶/chug/ MEGA https://mega.nz/folder/wbUjTLhb#BEBBRpmJN0Pih6YCXzkOXg ▶Resources & misc links https://rentry.org/chug2024#linksresources ▶Podcasts & Analysis https://rentry.org/chug2024#podcastsanalysis ▶Z Radio https://radio-zhizn.ru/",
    "link": "//boards.4chan.org/pol/thread/497728468",
    "number_of_posts": "R: 36 / I: 17▶"
  },
  {
    "title": "GIGA HAPPENING!!!: https://www.youtube.com/live/6FZvgQZ6ShI",
    "link": "//boards.4chan.org/pol/thread/497726434",
    "number_of_posts": "R: 98 / I: 35▶"
  },
  {
    "title": "FUNNIEST STORY OF THE YEAR JUST DROPPED: >Mordechai Brofman, a Miami Beach Jew, was arrested on Saturday for opening fire on another vehicle and striking two people inside. >In his arrest form, police said that Brafman “spontaneously stated that while he was driving his truck, he saw two Palestinians and shot and killed both.” >The two men were later revealed to be Israeli Jews, who reported to Israeli media that they were the victims of an anti-semitic attack https://amp.miamiherald.com/news/local/crime/article300433159.html",
    "link": "//boards.4chan.org/pol/thread/497712510",
    "number_of_posts": "R: 235 / I: 56▶"
  },
  {
    "title": "I speak for ALL of /pol/ when I say: Curtis Yarvin is right. We need a Techno-Monarchy in the United States.",
    "link": "//boards.4chan.org/pol/thread/497728364",
    "number_of_posts": "R: 9 / I: 2▶"
  },
  {
    "title": "The Truth: Adolf stated clearly that Germanics and Northern Europeans are peak Aryans, he didn't said jack shit about Anglos or white Americans being worthy of anything You amerimutts are clearly out of your league. You are not even ethnicity. Everybody can be Americans if they are US citizens. You don't even need to speak the language well.",
    "link": "//boards.4chan.org/pol/thread/497728582",
    "number_of_posts": "R: 7▶"
  },
  {
    "title": "Why are schools completely hesitant to kick out the worst behaving students?",
    "link": "//boards.4chan.org/pol/thread/497730804",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "UKRAINE IS NOT ALONE: EUROPEANS ARE READY TO FIGHT AND DIE TO SAVE UKRAINE FROM RUSSIAN IMPERIALISM FUCK THE US AND FUCK JD NIGGER VANCE",
    "link": "//boards.4chan.org/pol/thread/497722769",
    "number_of_posts": "R: 84 / I: 10▶"
  },
  {
    "title": "Anti-knife training in Germany: Apparently all you need is a towel to stop a person coming at you with a knife. Walking down the street in Germany Suddenly, Ahmed from the local “cultural enrichment center” decides it’s stab-o-clock Oh no.exe Remember my state-mandated anti-knife training Calmly remove my tactical anti-terror towel™ Start whipping like I’m drying off after a pool party Knife Chad lunges, towel does literally nothing “Nein, you’re supposed to be disarmed by my towel-fu!” Get turned into bratwurst Local media reports “lone wolf attack,” recommends more towel training",
    "link": "//boards.4chan.org/pol/thread/497723234",
    "number_of_posts": "R: 67 / I: 10▶"
  },
  {
    "title": "Now look what you've done: https://xcancel.com/Beefeater_Fella/status/1891280208319131845#m America, you made the chief European diplomat at the Munich Security Conference cry. Don't you feel any shame for yourselves? Now Europe will have to get *really* tough on you",
    "link": "//boards.4chan.org/pol/thread/497728620",
    "number_of_posts": "R: 63 / I: 7▶"
  },
  {
    "title": "Trump driving around the Daytona 500: Is Trump the most charismatic President the world has ever seen?",
    "link": "//boards.4chan.org/pol/thread/497716803",
    "number_of_posts": "R: 136 / I: 24▶"
  },
  {
    "title": "The Great Con: How is this autistic fuck managing to pull off a con of such magnitude? People have to see through his bullshit, right? Just look at his long history of hyping up shit only to under deliver, including shit that isn't even technically possible. Really shows that he is not half the genius he claims to be, yet now he's responsible for gutting agencies within the most powerful nation on Earth. Trump needs to ditch this test tube baby producer and fast.",
    "link": "//boards.4chan.org/pol/thread/497718706",
    "number_of_posts": "R: 204 / I: 25▶"
  },
  {
    "title": ">Destroys Europe with one speech >Heh, nothing personnel Why are Europoors such sissy crybabies?",
    "link": "//boards.4chan.org/pol/thread/497729822",
    "number_of_posts": "R: 27 / I: 10▶"
  },
  {
    "title": "aus/pol/: https://www.khon2.com/local-news/woman-found-dead-in-waikiki-dumpster-identified/ dinnies?",
    "link": "//boards.4chan.org/pol/thread/497724729",
    "number_of_posts": "R: 40 / I: 6▶"
  },
  {
    "title": "well?",
    "link": "//boards.4chan.org/pol/thread/497723269",
    "number_of_posts": "R: 75 / I: 6▶"
  },
  {
    "title": "PRESIDENT TRUMP GENERAL - NEVER CONSNEED EDITION /ptg/: PRESIDENT DONALD J TRUMP @POTUS45 https://www.donaldjtrump.com/ https://www.thetrumparchive.com/ https://twitter.com/realDonaldTrump https://truthsocial.com/@realDonaldTrump https://rumble.com/c/DonaldTrump https://www.tiktok.com/@realdonaldtrump >President Trump Office https://www.whitehouse.gov/ https://www.youtube.com/user/whitehouse https://www.flickr.com/photos/whitehouse/ >Liz Harrington (Trump Spox) https://twitter.com/realLizUSA >Donald J Trump Presidential Library https://www.trumplibrary.gov/ @realDonaldTrump @TeamTrump @TrumpWarRoom >b-but Trump hasnt done anything! ARCHIVED LINKS https://pastebin.com/eAhgNyeX NEW APPEARANCES >Pres Trump Day 17 Executive Orders, Washington, DC 2/5/2025 https://rumble.com/v6hdnlv-full-speech-president-trump-signs-eos-pete-hegseth-meets-with-netanyahu-252.html (RSBN) >Pres Trump Day 16 Executive Orders, Washington, DC 2/4/2025 https://youtu.be/1hWZ8oG_x9I >Pres Trump Day 15 Executive Orders, Washington, DC 2/32025 https://youtu.be/07UH2FTaqE4 >Pres Trump Day 11 Executive Orders, Washington, DC 1/30/2025 https://youtu.be/dzJKE88gtdo >Pres Trump Roundtable, Palisades, CA 1/25/2025 https://youtu.be/DU6QiR6u_Yw >Pres Trump Day 4 Executive Orders, Washington, DC 1/23/2025 https://youtu.be/3rmWeGbfN8o >Pres Trump Remarks in Emancipation Hall, Washington, DC 1/20/2025 https://www.c-span.org/program/white-house-event/president-trump-remarks-in-emancipation-hall/654699 >Pres Trump Inaugural Address, Washington, DC 1/20/2025 https://www.c-span.org/program/white-house-event/president-donald-trump-second-inaugural-address/654692 >Pres Trump Pre-Inauguration Rally, Washington, DC 1/19/2025 https://x.com/realDonaldTrump/status/1881073769449492971 >TrumpVideo: WE WILL WIN 6/19/23 https://rumble.com/v2v6m2a >MAKE AMERICA GREAT AGAIN, AGAIN! 10/28/21 https://rumble.com/voe8gm >God Bless the USA (Donald J Trump) 10/20/16 https://youtu.be/O_PC_fy0fk0 OP pastebin: http://pastebin.com/X4KiALfh prev >>497722790",
    "link": "//boards.4chan.org/pol/thread/497729136",
    "number_of_posts": "R: 50 / I: 21▶"
  },
  {
    "title": "No instances of fraud found by DOGE yet: >“As part of our commitment to improving opportunity for women everywhere, this Thursday we are launching the first ever government-wide initiative focused on economic empowerment for women in developing countries” >Days later in the Oval Office, joined by Ivanka Trump, top officials and women directly impacted by US funding for women’s economic empowerment abroad, he signed a presidential memorandum establishing W-GDP, the Women’s Global Development and Prosperity initiative, calling it a matter of national security and a “tremendous step for women.” https://edition.cnn.com/2025/02/08/politics/ivanka-trump-usaid-work/index.html So where's the instances of \"FRAUD\" that we were promised?",
    "link": "//boards.4chan.org/pol/thread/497723900",
    "number_of_posts": "R: 181 / I: 39▶"
  },
  {
    "title": "When did you stop believing in climate hysteria? For me, around 2017.",
    "link": "//boards.4chan.org/pol/thread/497730454",
    "number_of_posts": "R: 5▶"
  },
  {
    "title": "GERMANY IS ARRESTING PEOPLE FOR CARTOONS!!!: HAPPENING!!!!! https://x.com/60Minutes/status/1891282314899910910 https://www.cbsnews.com/news/policing-speech-online-germany-60-minutes-transcript/",
    "link": "//boards.4chan.org/pol/thread/497715560",
    "number_of_posts": "R: 211 / I: 42▶"
  },
  {
    "title": "So all he has to do is blames Muslims for all of Hungary’s problems and gets re-elected?",
    "link": "//boards.4chan.org/pol/thread/497727652",
    "number_of_posts": "R: 9 / I: 1▶"
  },
  {
    "title": "Blue Sky: Lets check on what the Democrat party Twitter clone is talking about.",
    "link": "//boards.4chan.org/pol/thread/497728850",
    "number_of_posts": "R: 60 / I: 17▶"
  },
  {
    "title": "/pol/ webm thread",
    "link": "//boards.4chan.org/pol/thread/497728346",
    "number_of_posts": "R: 42 / I: 27▶"
  },
  {
    "title": ">Freedom of speech caused the Holocaust This is actually the Democrats stance right now, not even trolling.. https://m.youtube.com/watch?v=onHvbQKwGps",
    "link": "//boards.4chan.org/pol/thread/497720014",
    "number_of_posts": "R: 122 / I: 25▶"
  },
  {
    "title": "We made euro politicians cry: Your gay politicians cried on camera because we called them gay bitches. Explain yourself right now.",
    "link": "//boards.4chan.org/pol/thread/497729127",
    "number_of_posts": "R: 14 / I: 5▶"
  },
  {
    "title": "CHINA TO REBULD WARTORN UKRAINE/RUSSIA LANDS: The new states annexed into Russia will be rebuilt by Chinese companies.",
    "link": "//boards.4chan.org/pol/thread/497730006",
    "number_of_posts": "R: 3▶"
  },
  {
    "title": "9 nations of North America: What's your take on this book and the concept of it?",
    "link": "//boards.4chan.org/pol/thread/497729984",
    "number_of_posts": "R: 9▶"
  },
  {
    "title": "Why have Bongs banned knives when anyone can make one of these with a $10 piece of steel from any hardware store, an angle grinder, and belt sander?",
    "link": "//boards.4chan.org/pol/thread/497730689",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "Canada refuses to become part of America: CANADA IS NOT FOR SALE!",
    "link": "//boards.4chan.org/pol/thread/497726904",
    "number_of_posts": "R: 32 / I: 2▶"
  },
  {
    "title": "Ireland... Do something",
    "link": "//boards.4chan.org/pol/thread/497730208",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "So who is in the wrong here?: Are male feminists natural sexual harassers or is the Dago not guilty? What does /pol/ think? >inb4 hollyjew",
    "link": "//boards.4chan.org/pol/thread/497729713",
    "number_of_posts": "R: 8 / I: 2▶"
  },
  {
    "title": "Europoors are liars: >White can't be Muslims! >Islam isn't European! Yet there are millions of WHITE Muslims in the Balkans, which has been the case of hundreds of years. These WHITE Muslims are even the majority in some countries in EUROPE. Curious.",
    "link": "//boards.4chan.org/pol/thread/497728305",
    "number_of_posts": "R: 5 / I: 3▶"
  },
  {
    "title": "Ohhhhhhhh Canada we stand on guard foooooor theeeeeee",
    "link": "//boards.4chan.org/pol/thread/497702927",
    "number_of_posts": "R: 175 / I: 33▶"
  },
  {
    "title": "Indian hate will soon be illegal in the US punishable by law: Land of the free strikes again. You will accept millions of \"Hindu Americans\" and you will like it. Why don't they ever pass anything like this to protect Christians? https://www.congress.gov/bill/118th-congress/house-resolution/1131/text",
    "link": "//boards.4chan.org/pol/thread/497695476",
    "number_of_posts": "R: 154 / I: 53▶"
  },
  {
    "title": "Global opinion of China improves: The rising pro-China sentiment on the internet is just a taste of what's to come.",
    "link": "//boards.4chan.org/pol/thread/497727813",
    "number_of_posts": "R: 9 / I: 1▶"
  },
  {
    "title": "Jewish Prime Minister Candidate Karina Gould offers Canadians UBI (free money for life): Say something nice about her.",
    "link": "//boards.4chan.org/pol/thread/497729163",
    "number_of_posts": "R: 6▶"
  },
  {
    "title": "February 2025: I Am Forgotten",
    "link": "//boards.4chan.org/pol/thread/497728488",
    "number_of_posts": "R: 7 / I: 5▶"
  },
  {
    "title": "Behavior has nothing to do with race: impoverished whites act like subhumans",
    "link": "//boards.4chan.org/pol/thread/497700511",
    "number_of_posts": "R: 282 / I: 56▶"
  },
  {
    "title": "I KNEW YOU ANTI VAXXERS WERE STUPID BEFORE BUT HOLY SHIT!!: NOW YOU MOTHERFUCKERS ARE PRO MEASLES? LMAO  This fucking retard even has a doctor website for brain dead anti VAXXERS to pay him  https://mygotodoc.com/",
    "link": "//boards.4chan.org/pol/thread/497729594",
    "number_of_posts": "R: 18 / I: 6▶"
  },
  {
    "title": "The answer is non-belief, in anything: Most neo-atheists are as religious as traditional religious folk if not more. Scientism became the new founded religion. The holocaust became the foundation creation myth for modern morals. Neo-atheists simply comply with the authority of some scientists that tells them what to believe as true and they accept it under blind faith. Much like religious people who never read or understand scripture, in the same way these people cannot read scientific papers or do basic algebra. The big bang is literally an \"out of nothing\" scripture with the only explanation being mathematical abstracts that scientists themselves do not even understand. Same question remains. Who or what make it bang? Go further down and you have to ask \"who created the creator?\". If you say \"all everything existed and just recycles itself\" then you starting to get somewhere. Anything else and you a digging yourself into a deeper derp hole.  What makes someone intelligent is non belief in anything. Questioning everything from the holocaust to manned moon landings and so on. Assume the null hypothesis, in everything from Elon, the system and how things work. This is what makes the wheels in your brain spin. Most people, including atheists cannot do this. They would rather let someone else do the thinking for them. Most people, atheists or not need someone else to tell them what to believe. They don't have an independent authority. They actually hate having one.  Free yourself from belief. In any shape or form.",
    "link": "//boards.4chan.org/pol/thread/497724037",
    "number_of_posts": "R: 9▶"
  },
  {
    "title": "Women are freaking out they are falling in love with chuds",
    "link": "//boards.4chan.org/pol/thread/497730276",
    "number_of_posts": "R: 4 / I: 1▶"
  },
  {
    "title": "should we NEET or not? Why?",
    "link": "//boards.4chan.org/pol/thread/497720843",
    "number_of_posts": "R: 121 / I: 11▶"
  },
  {
    "title": "What was your biggest red-pilling moment?",
    "link": "//boards.4chan.org/pol/thread/497727181",
    "number_of_posts": "R: 10 / I: 3▶"
  },
  {
    "title": "Moonman, moonman can't you see? >Spics and Niggers need to hang from trees https://www.bitchute.com/video/OlRLPuhrfJN0/",
    "link": "//boards.4chan.org/pol/thread/497728286",
    "number_of_posts": "R: 2 / I: 1▶"
  },
  {
    "title": "JEWISH WOMEN ARE UG-ACCCKKKK: if you would stick your dick up this yentas shit hole and stir last nights gefilte fish, are you even straight?",
    "link": "//boards.4chan.org/pol/thread/497706324",
    "number_of_posts": "R: 178 / I: 68▶"
  },
  {
    "title": "why can't god believers beat Matt?",
    "link": "//boards.4chan.org/pol/thread/497730159",
    "number_of_posts": "R: 8 / I: 1▶"
  },
  {
    "title": "NATO is done: > MUNICH — European officials say they get Donald Trump’s point: They need to take care of their own defense — with less help from the Americans.  >But on the sidelines of the Munich Security Conference this weekend, few European allies were raising their hands. Hahahah!",
    "link": "//boards.4chan.org/pol/thread/497729049",
    "number_of_posts": "R: 18 / I: 1▶"
  },
  {
    "title": "February 17th, will be the day of reckoning: >No bail fund >Blatantly committing a felony I can't wait to see these fuckers rot in prison like our Jan 6 brothers, they're just making it too easy to keep winning LMFAO",
    "link": "//boards.4chan.org/pol/thread/497730106",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "What sorcery is this?",
    "link": "//boards.4chan.org/pol/thread/497724292",
    "number_of_posts": "R: 71 / I: 16▶"
  },
  {
    "title": "/BUG/ - BREAKING USAID GENERAL #29: >UPDATE 2/10/25: WE NEED A SOCIAL MEDIA TEAM TO POST OUR BIG FINDS FOR THE NORMIES  >Post them in the replies sections of big accounts that report a lot on USAID, such as Mike Benz's account WE NEED TEAMS FOR ALL TASKS >Finding People & NGO's to dig through  >Diggers >Amplify Big Finds on Social Media >Salt Miners to bring back for our troops to enjoy >Among Other Tasks > /BUG/ Background Getting to the heart of the democrap machine, the shit that's too shady for the CIA to touch, bringing Democracy™ to the world, all the color revolutions, global propaganda, censorship, weaponizing advertisers, slushfunds & money laundering of dem elites and politicians including their side income and no-show jobs. Even Bill Gates received $15M for a single foundation, Chelsea Clinton got $84M, Politico got $32M, NYT $3.1M, BBC $3.2M, pretty much anything related to ukie-land including 90% of ukie news & the banning of christian churches in ukie-land... >HOW TO SEARCH: https://x.com/DataRepublican/status/1887191624750670294 RESOURCES TO SEARCH: https://datarepublican.com/ > Flow charts to track money across orgs https://www.usaspending.gov/ >Has tons of advanced filters, ie. Whale payments of $100M-$500M, or >$500M https://www.highergov.com/ >Great for high detailed info. Has grants not visible on the others. Use the Google search loophole to avoid the need to register SEARCH FOR INCOME TAX FILINGS  > Name Search https://projects.propublica.org/nonprofits/search?q=jews >Use this page if you have the EIN https://datarepublican.com/nonprofit/ CHAN Laundered Foreign Aid: https://archive.4plebs.org/pol/thread/477065004/#477074314 Tides Foundation Shilling on 4chan via Community Centers Years Ago: https://archive.4plebs.org/pol/thread/279999278/#279999278 https://thebarchive.com/b/thread/763798630/",
    "link": "//boards.4chan.org/pol/thread/497701165",
    "number_of_posts": "R: 122 / I: 44▶"
  },
  {
    "title": "Forbidden Knowledge Thread - 500 Years of Forbidden History: This story begins in the mid-1500s when Jews, expelled from Spain and Portugal during the inquisitions of the late 1400s, found refuge and eventually established a significant presence in Amsterdam. Over time, they played a key role in shaping the city's financial landscape, including the creation of the Amsterdam Stock Exchange in 1602 and the establishment of the Bank of Amsterdam in 1609. These institutions became models for future financial systems. Many people overlook the fact that the United States made early attempts to form a central bank, first in 1791 and again in 1816. The first central bank, established in 1791, operated for 20 years before Congress refused to renew its charter. This decision contributed to the economic instability that ultimately led to the War of 1812. In Europe, the financial center of gravity shifted from Amsterdam to London following the Glorious Revolution of 1688. The Bank of England, established in 1694, became a cornerstone of this new financial order. Jewish banking dynasties, who had already tested their financial systems in Amsterdam, played a significant role in this transition. The Glorious Revolution also marked the end of the centuries-long struggle in England over absolutism and the divine right of kings, as power shifted to Parliament. The City of London, a sovereign entity within England, emerged as the new hub of global finance, heavily influenced by these banking interests.",
    "link": "//boards.4chan.org/pol/thread/497723142",
    "number_of_posts": "R: 36 / I: 26▶"
  },
  {
    "title": "CEO Phenotype and FWHR: Are more compact faces more evil?",
    "link": "//boards.4chan.org/pol/thread/497730609",
    "number_of_posts": "R: 1 / I: 1▶"
  },
  {
    "title": "Is time going faster lately?",
    "link": "//boards.4chan.org/pol/thread/497727419",
    "number_of_posts": "R: 25 / I: 2▶"
  },
  {
    "title": "Johnny Somali is back…: So I guess the gooks didn’t take care of him like they said they would. And now he’s back threatening to be a fucking jackass in Japan again. https://x.com/AsianDawn4/status/1891192773891522807 I am so tired of this guy, I sincerely hope he comes back here because people aren’t going to tolerate his BS here anymore. He’d be floating face down in a fucking klong guaranteed if he shows his nigger ass back there.",
    "link": "//boards.4chan.org/pol/thread/497729100",
    "number_of_posts": "R: 13▶"
  },
  {
    "title": "Remind leftards that measles only has a 0.2% death rate: That's even lower than the kung flu.",
    "link": "//boards.4chan.org/pol/thread/497713590",
    "number_of_posts": "R: 143 / I: 21▶"
  },
  {
    "title": "Pam Bondis very first act as AG was to establish an antisemitism task force.",
    "link": "//boards.4chan.org/pol/thread/497730292",
    "number_of_posts": "R: 5▶"
  },
  {
    "title": "Do you care about Palestine?",
    "link": "//boards.4chan.org/pol/thread/497726050",
    "number_of_posts": "R: 22 / I: 1▶"
  },
  {
    "title": "I'll have a lot more to say on this, but I got my termination email last night from Elon's federal hack job, so now I get to try and find a job again. I'd just like to personally thank every single one of you who voted for Trump, or third party, or didn't vote at all, because you're directly responsible for this, and the soon to be tens, if not hundreds of thousands of other feds that are now out of work. Congratulations. I'm really not checking or posting to FB anymore, but I encourage everyone reading this to stay very informed about what's happening inside the Federal government right now. I suggest AP News. Like, several times a day.",
    "link": "//boards.4chan.org/pol/thread/497730202",
    "number_of_posts": "R: 1▶"
  },
  {
    "title": "Surely this will bring down grocery prices",
    "link": "//boards.4chan.org/pol/thread/497728575",
    "number_of_posts": "R: 22 / I: 7▶"
  },
  {
    "title": "Daily Reminder:: Germany has never won war.",
    "link": "//boards.4chan.org/pol/thread/497728112",
    "number_of_posts": "R: 26 / I: 3▶"
  },
  {
    "title": "Expectations for Men: Nowadays, girls expect guys to have: a good career, a good apartment, make 80k a year, have a 6 pack, drive a nice car, be tall and be funny. Has it always been this competitive? Or is this just a cultural change?",
    "link": "//boards.4chan.org/pol/thread/497711811",
    "number_of_posts": "R: 195 / I: 30▶"
  },
  {
    "title": "HAPPENING! — SCIENTIST EXPOSES MODERN SCIENCE AS. A LIE AND MONEY LAUNDERING SCHEME: https://m.youtube.com/watch?v=shFUDPqVmTg&pp=ygUGc2FiaW5l They even use “le science!l” as a means to import more shitskins.",
    "link": "//boards.4chan.org/pol/thread/497727780",
    "number_of_posts": "R: 41 / I: 9▶"
  },
  {
    "title": "I am a Romanian Muslim Republican AMA: Contrary to popular belief, there are actually plenty of white Muslims. They are typically Slavic/balkan and want their daughters to marry other white Muslims. You can literally have your dream white wife if you convert. You are also immune to all leftist attacks because they considered Muslims oppressed. So it’s a win-win",
    "link": "//boards.4chan.org/pol/thread/497722589",
    "number_of_posts": "R: 32 / I: 11▶"
  },
  {
    "title": "Donald Trump is not a serious President: He's complaining about wasteful spending... Isn't going to the Super Bowl and Daytona much more wasteful compared to whatever DOGE found?",
    "link": "//boards.4chan.org/pol/thread/497727245",
    "number_of_posts": "R: 49 / I: 6▶"
  },
  {
    "title": ">go to joint security conference to discuss an ongoing war with your military allies >use your speech to rant for 20 minutes about freeze peach culture war shit you saw on twitter Is he retarded?",
    "link": "//boards.4chan.org/pol/thread/497719914",
    "number_of_posts": "R: 166 / I: 27▶"
  },
  {
    "title": "If youre a drone operator, and an injured soldier who has cast away his weapon begs you for mercy. What would you do? A ukrainian would blow him up. I wouldn't. Does that mean that a ukranian is totally different morally from me?",
    "link": "//boards.4chan.org/pol/thread/497728371",
    "number_of_posts": "R: 13▶"
  },
  {
    "title": "MAGA extremists got bamboozled once again: Most Trump voters only voted for him because he said he was going to lower egg prices. Now, well into the start of his presidency, egg prices have reached an ALL-TIME HIGH! How do MAGA extremists keep falling for his crap? It’s lie after lie that they all gobble up. Getting duped time and time again. It would be funny if our country literally wasn’t at stake. Oh well. Republikkkans will never learn. Here is the time where I repeat myself: I told you so. https://www.foxnews.com/food-drink/egg-prices-hit-record-high.amp",
    "link": "//boards.4chan.org/pol/thread/497726203",
    "number_of_posts": "R: 38 / I: 7▶"
  },
  {
    "title": "Europe needs its own military: Kick the mutts out and make Europe for Europeans. You can’t trust America as an ally. Simple as .",
    "link": "//boards.4chan.org/pol/thread/497729058",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "Did anyone knew the gigachad meme was made by indian / pajeet trying to recreate a chad version of a pajeet?",
    "link": "//boards.4chan.org/pol/thread/497730354",
    "number_of_posts": "R: 3 / I: 1▶"
  },
  {
    "title": ">America couldn't singlehandedly-destroy Canada in a week TOP KEK CANADIAN PIG SHIT!!! Oh believe you me, us Americans are ITCHING for a war with the entire Great White North. We will fucking ANNIHILATE your dirty commonwealth. There wouldn't be a square meter of CA soil that has running water, electricity, or petrol that isn't on fire, once our airforce and navy is done bombarding your defenseless country. Then, our army boys (we'd send the niggers and other mongrel races first) would swoop in, raping your women, and killing EVERY anglo/jeet/chink pig shit they see. When America's done with you, we will have committed acts of genocide. Of course no one is gonna do shit about it",
    "link": "//boards.4chan.org/pol/thread/497728717",
    "number_of_posts": "R: 28 / I: 7▶"
  },
  {
    "title": "Testing, testing... is this thing on? Haha... Na.",
    "link": "//boards.4chan.org/pol/thread/497730465",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "Leaked Video Osama Bin Ladden (9/11 guy) singing Lady Gaga's song Poker Face: https://files.catbox.moe/m6iuwk.mp4",
    "link": "//boards.4chan.org/pol/thread/497730461",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "*ASVAB Waivers*",
    "link": "//boards.4chan.org/pol/thread/497730437",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "How do I know if I have a soul?",
    "link": "//boards.4chan.org/pol/thread/497726609",
    "number_of_posts": "R: 95 / I: 13▶"
  },
  {
    "title": "German officials literally sobbing over Vance's speech the other day: https://x.com/CilComLFC/status/1891279275682128131",
    "link": "//boards.4chan.org/pol/thread/497721034",
    "number_of_posts": "R: 92 / I: 15▶"
  },
  {
    "title": "A MESSAGE TO AMERICANS FROM A CANADIAN: DO NOT LET UP!!! DO NOT LET TRUMP BACK DOWN FROM ANNEXING US. THIS COUNTRY IS WEAK AND NEEDS A WAKE UP CALL! IMPOSE MASSIVE TARIFFS AND STRANGLE THIS COUNTRY TO DEATH. THERE IS NO OTHER WAY. WE WILL REBUILD FROM THE ASHES. BUT FIRST IT ALP HAS TO BE BURNT DOWN. THIS COUNTRY IS FUCKING BROWN AMD POOR. FILLED WITH DRUG ADDICTS, WELFARE LEACHES, AND SHITSKIN IMPORTED PARASITES. THE CANADA OF OLD IS DEAD. ANNEX US. NOW. STRANGLE THIS PATHETIC COUNTRY TO DEATH ECONOMICALLY AND FORCE US TO CAPITULATE. I BEG YOU.",
    "link": "//boards.4chan.org/pol/thread/497712139",
    "number_of_posts": "R: 146 / I: 25▶"
  },
  {
    "title": "1940s-60s home movies: A while back I found some old 16mm home movies at an estate sale. Here's a look at what middle america was like back then from a real family, and not TV shows/movies",
    "link": "//boards.4chan.org/pol/thread/497721276",
    "number_of_posts": "R: 45 / I: 20▶"
  },
  {
    "title": "Why are they so anti-social? Is there a genetic reason? I saw this shit today and I just can't wrap my head around it",
    "link": "//boards.4chan.org/pol/thread/497726988",
    "number_of_posts": "R: 17 / I: 8▶"
  },
  {
    "title": "Femanon here: Are you little boys really too wimpy to join the military?",
    "link": "//boards.4chan.org/pol/thread/497690676",
    "number_of_posts": "R: 200 / I: 53▶"
  },
  {
    "title": "Kikes are trying to destroy america from inside lets expand on how kikes operate: the western cycle of civilizational contraction and expansion is being subverted because the west is missing a \"reactionary\" class that serves the interests of their people and their survival in full awareness progressive utopianism is impossible because there will always be fifth collumns weaponizing naiveness to dominate your people. The reason behind is the forced secularization of institutions, the demonization of nationalism and the occupation of academia by Jews jews have a ethnic monopoly of the intelligence class, and use that power to both confront races and to keep them secular, meaning, not perceptive of jews Jews need to be intangible and unperceived to mantain a monopoly over academia and institutions If they mantain a Monopoly over academia they can as well do so over media, if they have a monopoly over media and academia they are those who staff financial institutions and promote logistics and similar business that require publicity. If they have a monopoly over this they have a total grip over the operational system of society, which can be only mantained if they are invisible before you, as it is understood that a system is better obfuscated to mantain centralization of power, as it is better to prevent attacks against it (mental information, meaning, logistics and economics, consultancy and politics are the backbone of society) and what way is better than supressing their enemies racial consciousness? If you dont see the jew you cant see the issue. because you dont understand the system To understand the current situation of western lesders you must see where the money comes from Is from ngos, business, financial pressure, investment. And all of that comes from american market invasion led by the people that heads academia. And guess who that people is?",
    "link": "//boards.4chan.org/pol/thread/497730378",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "Why is America antagonizing all its closest allies like Canada and Europe instead of China and Russia? How does this benefit Americans?",
    "link": "//boards.4chan.org/pol/thread/497730373",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "Appologise to Women",
    "link": "//boards.4chan.org/pol/thread/497728974",
    "number_of_posts": "R: 20 / I: 1▶"
  },
  {
    "title": "\"europe\": Migrants will not face punishment because the European Court of Human Rights will rule that upholding the law and deporting them will somehow be in violation of 'their' human rights. They will never be deported because some activits laywer will argue that there might be a chance that they will be mistreated of denied their \"rights\" in their home country.",
    "link": "//boards.4chan.org/pol/thread/497730361",
    "number_of_posts": "R: 1 / I: 1▶"
  },
  {
    "title": ">I-IT’S CALLED GULF OF AMERICA!!!! >WHY? >UHHHHHH, BECAUSE DADDY TRUMP SAID SO OKAY???!!",
    "link": "//boards.4chan.org/pol/thread/497729092",
    "number_of_posts": "R: 12 / I: 2▶"
  },
  {
    "title": "Hypothetically speaking; let’s say Trump invades Canada: He has the full backing of MAGA due to their die hard support of him How does this war unfold, and who would win?",
    "link": "//boards.4chan.org/pol/thread/497700427",
    "number_of_posts": "R: 251 / I: 36▶"
  },
  {
    "title": "Be honest: United States of America is inherently evil due to the fact that its founders were freemasons. There's no deep state, it's just the state itself",
    "link": "//boards.4chan.org/pol/thread/497716280",
    "number_of_posts": "R: 80 / I: 21▶"
  },
  {
    "title": "You did this: apologize",
    "link": "//boards.4chan.org/pol/thread/497728298",
    "number_of_posts": "R: 4▶"
  },
  {
    "title": "Jews are shooting at other jews because they can't tell jews apart from Arabs. How to profit from this?",
    "link": "//boards.4chan.org/pol/thread/497729627",
    "number_of_posts": "R: 4 / I: 1▶"
  },
  {
    "title": "Thoughts?",
    "link": "//boards.4chan.org/pol/thread/497725721",
    "number_of_posts": "R: 23 / I: 4▶"
  },
  {
    "title": "Humans deserve execution for being conceived -- Christianity: Christianity is a bizarre religion. I will not say it is sick or twisted, as I am not prepared to go that far, but it is definitely morbid, worshiping images of a man nailed to a cross and saying every conceived embryo deserves to be killed for the original sin of Adam and Eve. That's why we die, according to Christianity: because Adam and Eve ate a forbidden apple, so God cursed all humanity to suffer and rot and die. I can definitely see the argument that pre-Christian paganism was more life affirming and that Christianity, like Buddhism, is sort of a death cult. The whole point of life is just to wait to die so we can go to the better place, which is the next life and the next world.  Evangelicals try to flip all this upside down but what they're doing is heresy that defies 2000 years of established Christian tradition and theology. Evangelicals try to make Christianity worldly like Judaism and Islam, but they are out of their element, since Christianity, in its bones, is morbid and death-oriented.  So in the ethnostate, or the Fourth Reich, will Christianity be replaced by neo-paganism, Islam, or a new religion altogether. Hitler said Europe would have developed better and more aggressively had it become Islamic. Maybe the future Islamic Europe, intermixed with a lot of Aryan genetics, will be much more powerful than Christian Europe ever was, and will rule the world for 1000 years as Hitler intended for the Third Reich. To you Muslims now in Europe, would you be European nationalists if Europe became Islamic and formed an Islamic, expansionistic Fourth Reich?",
    "link": "//boards.4chan.org/pol/thread/497727902",
    "number_of_posts": "R: 5▶"
  },
  {
    "title": "America needs a renewed commitment to both personal morality and competence. Politics has made us accepting of people like RFK Jr. who are both catastrophically incompetent and horribly immoral individuals.",
    "link": "//boards.4chan.org/pol/thread/497728007",
    "number_of_posts": "R: 13▶"
  },
  {
    "title": "Can you think of this, but with liberals instead of conservatives?",
    "link": "//boards.4chan.org/pol/thread/497725399",
    "number_of_posts": "R: 6▶"
  },
  {
    "title": "Every white person used to have this life in America",
    "link": "//boards.4chan.org/pol/thread/497721019",
    "number_of_posts": "R: 48 / I: 9▶"
  },
  {
    "title": "HOLY BASED autonomous drone maker, and major thiel/musk backed military contractor who Musk says he will award all new DoD military industrial complex contracts to, says jews deserve a homeland and whites (or as he calls them the kkk) don’t!  https://x.com/logicrestored/status/1891342459034034524?",
    "link": "//boards.4chan.org/pol/thread/497726004",
    "number_of_posts": "R: 16 / I: 6▶"
  },
  {
    "title": "ok this is based >Burr then went after President Donald Trump’s plan to rename the Gulf of Mexico to calling him a “laminated face cunt.” >“The fucking epitome of this time right now, like how divisive we are that, like, the Gulf of Mexico is now the Gulf of America, and people get excited. Like, how the fuck does that help your wallet? It’s an empty gesture. And then it’s also like a racist gesture,” Burr said. >Trump’s plan, he added, really amounts to a simple message: “Fuck Mexicans.” >“That’s the white guy saying ‘Fuck Mexicans’ without saying it,” he said. “You know, like who has a fucking problem with Mexicans? What is the real problem? This is just such an ugly fucking time.” https://x.com/TMZ/status/1890156391341658484",
    "link": "//boards.4chan.org/pol/thread/497719026",
    "number_of_posts": "R: 69 / I: 14▶"
  },
  {
    "title": "Humo for the masses: Humor with a hard R for those in the know",
    "link": "//boards.4chan.org/pol/thread/497695108",
    "number_of_posts": "R: 135 / I: 104▶"
  },
  {
    "title": "why do y'all want ww3 to happen so bad?",
    "link": "//boards.4chan.org/pol/thread/497727857",
    "number_of_posts": "R: 20 / I: 3▶"
  },
  {
    "title": "Gay imam Mushin Hendricks (57) was shot dead out on the streets South Africa.",
    "link": "//boards.4chan.org/pol/thread/497730016",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "Five White people charged with torture, murder of trans man in upstate NY: >Five people were charged by New York State police with the murder of a missing transgender man, whom authorities say was tortured for more than a month. Sam Nordquist, a 24-year-old originally from Minnesota, was reported missing on 9 February. He had arrived in New York in September and later lost contact with loved ones, police said. The accused, all from the area near where Nordquist's body was discovered in northern New York, are: Precious Arzuaga, Patrick Goodwin, Kyle Sage, Jennifer Quijano, and Emily Motyka. They range in age from 19 to 38. >Police said Nordquist's body was discovered in a field on Thursday in the town of Benton, located around 53 miles (85 kilometres) southeast of Rochester. They said they searched a room about 20 miles away from where the body was found, where they uncovered that Nordquist had suffered \"prolonged physical and psychological abuse at the hands of multiple individuals\" from early December until this month. Major Kevin Sucher of the New York State Police said the facts and circumstances of the case were \"beyond depraved\" and \"by far the worst\" homicide investigation his office had undertaken. \"No human being should have to endure what Sam endured,\" Major Sucher said. https://www.bbc.com/news/articles/c391grm0g3no",
    "link": "//boards.4chan.org/pol/thread/497722755",
    "number_of_posts": "R: 35 / I: 4▶"
  },
  {
    "title": "Powerful",
    "link": "//boards.4chan.org/pol/thread/497725812",
    "number_of_posts": "R: 13 / I: 5▶"
  },
  {
    "title": "Donald Trump has failed America: Regret voting for Donald Trump yet?  Even Kamala Harris would have saved people from the floods in Kentucky. Sad!",
    "link": "//boards.4chan.org/pol/thread/497727036",
    "number_of_posts": "R: 13 / I: 2▶"
  },
  {
    "title": "President-elect Donald Trump has promised to carry out the largest deportation operation in American history. While he has provided few specifics about how his administration would accomplish this, Trump has indicated that he will declare a national emergency and that he will invoke both the Insurrection Act and the Alien Enemies Act. A common theme in almost all of his statements is his intent to deploy the military https://www.youtube.com/watch?v=8dDVppzDwJA",
    "link": "//boards.4chan.org/pol/thread/497728263",
    "number_of_posts": "R: 6 / I: 2▶"
  },
  {
    "title": ">Mordechai Brafman, 28, a pro-Israel fanatic, fired 17 shots at a father and son in Miami Beach, injuring both. Believing he had killed them, he smiled and told police, “I killed two Palestinians.” >Ironically, the victims were Israeli tourists. And right after being shot, they took to social media chanting 'Death to Arabs'  This shit is parody at this point lmao",
    "link": "//boards.4chan.org/pol/thread/497728321",
    "number_of_posts": "R: 5 / I: 3▶"
  },
  {
    "title": "The jew fears the boycott",
    "link": "//boards.4chan.org/pol/thread/497714196",
    "number_of_posts": "R: 99 / I: 10▶"
  },
  {
    "title": "I know bringing up 1984 is low-tier observation: But holy shit, the press is actually on the verge of saying “War is peace.” No amount if hate for journalists is enough at this point",
    "link": "//boards.4chan.org/pol/thread/497729634",
    "number_of_posts": "R: 5▶"
  },
  {
    "title": "Robowaifus will make feminist women obsolete",
    "link": "//boards.4chan.org/pol/thread/497714263",
    "number_of_posts": "R: 144 / I: 83▶"
  },
  {
    "title": "How can we teach American women the importance of proper feminine hygiene practices?: Ooh, that smell. The first thing you're likely to sniff in this wretched life is a deep, sobbing lungful of your mother's afterbirth, yet that memory is usually too distant and traumatic to ever have a hope of salvaging. But after one passes the Age of Reason, you aren't likely to forget the full-frontal face-slap of a rancid pussy, even after extensive psychotherapy.",
    "link": "//boards.4chan.org/pol/thread/497729938",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "/DTTG/ Daily Tap Thread General #13: /DTTG/ Daily Tap Thread General #13 : \"All's quiet on the western front\" >What do we do here: shitpost and remind people that we're being psyopped >Why: we opted out and they want us back in the plantation, so we're being psyopped >Any evidence of this? yes, we're being psyopped >Links/proofs? ask in the thread",
    "link": "//boards.4chan.org/pol/thread/497684091",
    "number_of_posts": "R: 227 / I: 120▶"
  },
  {
    "title": ">do nothing >Elon and trump fires nuclear weapons scientists >Panic and rescind the firing, can't get in touch with them anymore, however >Hire them and acquire secrets >Win",
    "link": "//boards.4chan.org/pol/thread/497729871",
    "number_of_posts": "R: 2 / I: 1▶"
  },
  {
    "title": "Say something nice about niggers",
    "link": "//boards.4chan.org/pol/thread/497720735",
    "number_of_posts": "R: 66 / I: 19▶"
  },
  {
    "title": "Maybe before attempting to fix the world americans should try fixing their diet.",
    "link": "//boards.4chan.org/pol/thread/497723673",
    "number_of_posts": "R: 84 / I: 10▶"
  },
  {
    "title": "Global Warming Punishing West Virgnia And Hick Country: Do you right wingers still believe global warming is fake? Many dead on the east coast because of heavy rains the likes never seen before in decades.",
    "link": "//boards.4chan.org/pol/thread/497729188",
    "number_of_posts": "R: 8 / I: 2▶"
  },
  {
    "title": "In Canada, milk is sold in little plastic bags: Kek when did Canada become a 3rd world country?",
    "link": "//boards.4chan.org/pol/thread/497726743",
    "number_of_posts": "R: 8 / I: 2▶"
  },
  {
    "title": "The US showed their true colors: We're all alone against a world that hates Evropeans (mutts hate us, russians hate us, mudslimes hate us,...) It's time we unite under one flag, it's our only hope to stay relevant, we are EVROPEANS, we conquered the world!",
    "link": "//boards.4chan.org/pol/thread/497726482",
    "number_of_posts": "R: 18 / I: 6▶"
  },
  {
    "title": "Richard Stocher launches meme coin: The grift that keeps on grifting. https://pump.fun/coin/7aGNRgne9VTVmpq32CBZNUoyamsmBcFz7TWX2bwkpump",
    "link": "//boards.4chan.org/pol/thread/497728730",
    "number_of_posts": "R: 4▶"
  },
  {
    "title": "Trying to name the GOAT philosopher: And to me it’s Aristotle. Some say Nietzsche, but dude just wrote edgy fanfiction about himself Others say Kant, but good luck actually reading that brick without developing brain damage Then there’s Marx… lol Realize the answer has been obvious all along: Aristotle Literally built the entire framework of logic, ethics, politics, and metaphysics Chad-tier blend of reason and common sense—no self-defeating paradoxes, no cope, just pure understanding Every philosopher after him is basically just playing in the intellectual sandbox he built Without him, we’re all just barbarians grunting at the moon.",
    "link": "//boards.4chan.org/pol/thread/497724217",
    "number_of_posts": "R: 51 / I: 9▶"
  },
  {
    "title": "The vax wasn't made for covid its made to protect the obedient vaxxies from a future 99% fatality bioweapon.its mostly a fail safe option for the elites if climate change gets more worrying",
    "link": "//boards.4chan.org/pol/thread/497727785",
    "number_of_posts": "R: 4▶"
  },
  {
    "title": ">Trump unaware that China is part of BRICS Is his 80 year old mind slipping or is he just uninformed?  https://x.com/AdameMedia/status/1890920093363716587",
    "link": "//boards.4chan.org/pol/thread/497714672",
    "number_of_posts": "R: 66 / I: 16▶"
  },
  {
    "title": "What are we even supposed to do about mass migration? No matter what party you vote for, they will just find another loophole around importing tens of thousands of niggers into your country and make you pay for these subtards to exist near you. This is happening all over Europe, Canada and the USA. The “mass” deportations need to be in the millions, America needs to deport at least 10 million people within a four year span. Even if trump was serious about it, it could never be achieved since they would have a democrat back into office and allow more illegals back in anyways. It’s a continual loop of getting rid of parasites and then jews letting them back in, nothing is really changing it’s gradually getting worse. Cost of living is up globally, quality of life is dwindling, birth rates at an all time low, inflation soaring, and leftist subhumans unironically think importing another million shitskins will somehow fix this. This cannot be solved democratically",
    "link": "//boards.4chan.org/pol/thread/497717227",
    "number_of_posts": "R: 28 / I: 2▶"
  },
  {
    "title": "Do chinks have underdeveloped livers? Is that why they are yellow? Pic. Dad before and after Liver transplant.",
    "link": "//boards.4chan.org/pol/thread/497729231",
    "number_of_posts": "R: 6▶"
  },
  {
    "title": "Cancer: Best way to live out existence if you have metastatic cancer? You have 6-8 months to live.",
    "link": "//boards.4chan.org/pol/thread/497723018",
    "number_of_posts": "R: 77 / I: 9▶"
  },
  {
    "title": "Why does Xi Jinping have nigger nose and lips?",
    "link": "//boards.4chan.org/pol/thread/497727934",
    "number_of_posts": "R: 7 / I: 2▶"
  },
  {
    "title": "I'm ok with this.: Stammer sending british troops to ukraine could result in the massive losses of bong lives, but it's a risk I'm willing to take.",
    "link": "//boards.4chan.org/pol/thread/497720450",
    "number_of_posts": "R: 44 / I: 7▶"
  },
  {
    "title": ">...would hurt key programs and impair efforts to track threats to public health. Looks like (((they))) are upset they're losing their ability to fearmonger and control the population with imaginary diseases.",
    "link": "//boards.4chan.org/pol/thread/497728116",
    "number_of_posts": "R: 3▶"
  },
  {
    "title": "Is he ok?",
    "link": "//boards.4chan.org/pol/thread/497721580",
    "number_of_posts": "R: 37 / I: 10▶"
  },
  {
    "title": "Kraut bros are you ok? >CBS joined German police to conduct a raid on a citizen for posting a meme online https://x.com/libsoftiktok/status/1891342340805074984",
    "link": "//boards.4chan.org/pol/thread/497729068",
    "number_of_posts": "R: 4 / I: 1▶"
  },
  {
    "title": "Has Ben ever topped this one? Excellent work.",
    "link": "//boards.4chan.org/pol/thread/497728841",
    "number_of_posts": "R: 1 / I: 1▶"
  },
  {
    "title": "IT'S HAPPENING: NIGGERS WHO ABUSED PPP LOANS ARE GETTING ARRESTED https://x.com/hartgoat/status/1891225784515215843",
    "link": "//boards.4chan.org/pol/thread/497723994",
    "number_of_posts": "R: 38 / I: 12▶"
  },
  {
    "title": "Reichstag fire: Was this like Germany's January 6?",
    "link": "//boards.4chan.org/pol/thread/497726644",
    "number_of_posts": "R: 3▶"
  },
  {
    "title": "https://en.wikipedia.org/wiki/Holy_Alliance",
    "link": "//boards.4chan.org/pol/thread/497728676",
    "number_of_posts": "R: 1▶"
  },
  {
    "title": "RETWEETING FALSE INFORMATION PUTS YOU IN PRISON IN GERMANY: WTF IS GOING ON EUROPE??? They say so proudly that this is a crime.  https://x.com/60Minutes/status/1891282865381429292",
    "link": "//boards.4chan.org/pol/thread/497720840",
    "number_of_posts": "R: 77 / I: 14▶"
  },
  {
    "title": "YOU WENT TOO FAR",
    "link": "//boards.4chan.org/pol/thread/497729518",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "Remember the imGULAGED MAGAtards: Who were ruthlessly tortured and reeducated these past 4 years. Pray they are able to return back to wagecuckery in a timely manner.",
    "link": "//boards.4chan.org/pol/thread/497729519",
    "number_of_posts": "R: 1▶"
  },
  {
    "title": "Did you watch your saturday goy live?",
    "link": "//boards.4chan.org/pol/thread/497724462",
    "number_of_posts": "R: 15 / I: 8▶"
  },
  {
    "title": "But will they end the torturous treatment of livestock? Non-Organic livestock are raised indoors, in cages, their whole lives. They are fed grain, instead of the wide variety of herbs that grow in pastures, which is their natural diet. Some cages are so small, that the animal can't even turn around. The cages are not cleaned properly, so the animals are living in their own feces. They then are given antibiotics to counter the diseases. Antibiotics are not allowed for Organic livestock. If an Organic livestock animal does get sick, it is given an antibiotic and sold to an non-Organic farm. But disallowing them from being given antibiotics means they have to have higher living standards. Non-Organic livestock animals can also be given steroids. Not allowed for Organic. And Non-Organic livestock can be fed non-Organic feed, feed made with synthetic pesticides and preservatives. What a wonder it is that this is not mentioned in the list of reforms. The reforms he's calling for are great, don't get me wrong. But the resounding silence on livestock morality is telling. Of what? Of the strangehold that Big Food has in the political process. GMOs is also a problem, and is not mentioned. Large companies edit a crop's genes to be more bacteria-resistant. If a small farm accidentally acquires this crop through cross-pollination, the company that made the GMO can sue them. All livestock should be required to spend at least half their days outdoors. Some labels that say \"Pasture-raised\" are allowed to say that if the animals are \"given access\" to going outside, like if they leave the door open, whether or not the animals actually go outside. Animals should not be slaughtered until they die of old age. Yes, the meat will be tough, but d-a-r-n it, simmer it in a stew or something. Watch F00[), 1|\\|( documentary Also, killing insects and rodents with pesticides is bad for the environment in the long run, too.",
    "link": "//boards.4chan.org/pol/thread/497721563",
    "number_of_posts": "R: 39 / I: 5▶"
  },
  {
    "title": "Before you start thinking about changing the world, you should be damn sure that your room is clean.",
    "link": "//boards.4chan.org/pol/thread/497727353",
    "number_of_posts": "R: 7 / I: 2▶"
  },
  {
    "title": ">mutts: WE IZ DA NUMBER 1 COUNTRY IN DA WHOLES WORLD >also mutts: cannot explain why they are circumcised without seething Answer: you are a dumb branded goy cattlebeast slave owned by jews and you live in a ZOG nation.",
    "link": "//boards.4chan.org/pol/thread/497728591",
    "number_of_posts": "R: 1▶"
  },
  {
    "title": "JEETS are seriously the biggest threat to US sovereignty.",
    "link": "//boards.4chan.org/pol/thread/497725252",
    "number_of_posts": "R: 18 / I: 3▶"
  },
  {
    "title": "Cheat me at monopoly??: That is so unbelievably unbased it's the furtherst thing from based. Cheaters are riggers and riggers are so unworthy they do not even deserve to be a spek on my shoes.  Cheaters deserve to lose all their I'll gotten gains twice over.",
    "link": "//boards.4chan.org/pol/thread/497729356",
    "number_of_posts": "R: 3 / I: 1▶"
  },
  {
    "title": ">discovered the South African side of Twitter I think these might genuinely be the dumbest and most evil people in the world",
    "link": "//boards.4chan.org/pol/thread/497727308",
    "number_of_posts": "R: 16 / I: 2▶"
  },
  {
    "title": ">Putin won’t invade Ukraine  >Trump won’t be able to get a peace deal Is it time to stop listening to Mearsheimer?",
    "link": "//boards.4chan.org/pol/thread/497726492",
    "number_of_posts": "R: 13▶"
  },
  {
    "title": "Were they punished too lightly for starting two world wars?",
    "link": "//boards.4chan.org/pol/thread/497726642",
    "number_of_posts": "R: 9 / I: 4▶"
  },
  {
    "title": "Accurate.",
    "link": "//boards.4chan.org/pol/thread/497717234",
    "number_of_posts": "R: 88 / I: 13▶"
  },
  {
    "title": "FALLING FOR A JEWISH CHICK?: So hear me out, there's this chick at work who's Jewish. Tits the size of Wisconsin, I shit you not. She got some work done on her lips (injections), but they actually look really great and suit her face. Problem is, she won't give me the time of day. I accidentally liked one of her facebook pictures from 4 years ago, and when I saw her at work I approached her and said I don't know what happened, my friend was doing some weird stuff on my facebook, plus my app has been on the fritz. She didn't say anything or really react at all and just went back to doing her work, so I guess she forgot. And she has blue eyes and once I said her eyes look like blueberries and said I was hungry and would like to eat one. Again she didn't really react and just directed her attention to her work so I guess it was fine. What do you think I should do bros? I feel like I need to really impress her and show her how much I've self improved the last five years. Should I mention her Jewishness? I think it might go a long way towards breaking the ice and building a good rapport, but I'm not sure. What would you guys do?",
    "link": "//boards.4chan.org/pol/thread/497725975",
    "number_of_posts": "R: 8▶"
  },
  {
    "title": "/pol/ Will Reject This Woman: Listen to her describe how she wants a man of God and is praying to Jesus to send her one.  https://youtu.be/EEPQdKKA5rs /pol/ will reject her because she is half black. Despite her being a stunning Christian woman. Are you f'n crazy?",
    "link": "//boards.4chan.org/pol/thread/497724581",
    "number_of_posts": "R: 22 / I: 4▶"
  },
  {
    "title": ">Retarded beta cripple approaches Chad >Cripple tries to retardedly mumble a stupid question >Chad has no time for retard's antics >Chad puts him in his place and reminds him of his status How do you raise kids to be this based? This kid has CEO leadership material written all over him. https://x.com/Whiplash437/status/1890947798368944198",
    "link": "//boards.4chan.org/pol/thread/497723827",
    "number_of_posts": "R: 68 / I: 7▶"
  },
  {
    "title": "According to the Social Security database, these are the numbers of people in each age bucket with the death field set to FALSE! https://x.com/elonmusk/status/1891350795452654076",
    "link": "//boards.4chan.org/pol/thread/497728718",
    "number_of_posts": "R: 8 / I: 1▶"
  },
  {
    "title": "ITT: post video games that are redpilled on the Jews",
    "link": "//boards.4chan.org/pol/thread/497729337",
    "number_of_posts": "R: 1 / I: 1▶"
  },
  {
    "title": "What makes Americans just so damn funny?",
    "link": "//boards.4chan.org/pol/thread/497726392",
    "number_of_posts": "R: 6▶"
  },
  {
    "title": "What causes this?",
    "link": "//boards.4chan.org/pol/thread/497723779",
    "number_of_posts": "R: 24 / I: 1▶"
  },
  {
    "title": "Take. The. Pledge. NOW.",
    "link": "//boards.4chan.org/pol/thread/497721635",
    "number_of_posts": "R: 17 / I: 3▶"
  },
  {
    "title": "I understand Texas wants to keep the troons out of the wrong bathrooms, but this is going way too far.",
    "link": "//boards.4chan.org/pol/thread/497724734",
    "number_of_posts": "R: 32 / I: 3▶"
  },
  {
    "title": "WARNING: BUY STOCKS, CRYPTO, ANYTHING BUY RUSSIAN OIL MEMESTOCKS TRUMPCOIN ANYTHING. Ceasefire will happen this week and market will pump like never before seen. I'm talking $120k BTC minimum $6300-$6400 SPX.",
    "link": "//boards.4chan.org/pol/thread/497722894",
    "number_of_posts": "R: 18 / I: 4▶"
  },
  {
    "title": "IT’S RUBIO!",
    "link": "//boards.4chan.org/pol/thread/497721500",
    "number_of_posts": "R: 29 / I: 2▶"
  },
  {
    "title": "It's so funny to see jews saying that the Palestine narrative is bullshit when it's literally the exact same narrative jews have been putting om for 80 years",
    "link": "//boards.4chan.org/pol/thread/497726292",
    "number_of_posts": "R: 15 / I: 1▶"
  },
  {
    "title": ">the left are insane >the right are stupid >larping as a nazi is cringe Race-realist paleo-libertarians are the master race. The sort of high IQ intellectual vanguard who founded the \"alt-right\" back in the day.",
    "link": "//boards.4chan.org/pol/thread/497728565",
    "number_of_posts": "R: 1▶"
  },
  {
    "title": "Sorry for your loss god believers",
    "link": "//boards.4chan.org/pol/thread/497724989",
    "number_of_posts": "R: 25 / I: 7▶"
  },
  {
    "title": "Why would you live in America?",
    "link": "//boards.4chan.org/pol/thread/497728430",
    "number_of_posts": "R: 12 / I: 2▶"
  },
  {
    "title": "The final redpill: All women are whores and all whores deserve your love and respect. >no It's your duty as a man. Without woman we are nothing.",
    "link": "//boards.4chan.org/pol/thread/497728530",
    "number_of_posts": "R: 3▶"
  },
  {
    "title": "Honestly tho why'd they do it?",
    "link": "//boards.4chan.org/pol/thread/497727334",
    "number_of_posts": "R: 7 / I: 1▶"
  },
  {
    "title": ">kike is kang!",
    "link": "//boards.4chan.org/pol/thread/497728395",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "/ptg/ - PRESIDENT TRUMP GENERAL - ALSO NO NGO MONEY EDITION: PRESIDENT DONALD J TRUMP @POTUS45 https://www.donaldjtrump.com/ https://www.thetrumparchive.com/ https://twitter.com/realDonaldTrump https://truthsocial.com/@realDonaldTrump https://rumble.com/c/DonaldTrump https://www.tiktok.com/@realdonaldtrump >President Trump Office https://www.whitehouse.gov/ https://www.youtube.com/user/whitehouse https://www.flickr.com/photos/whitehouse/ >Liz Harrington (Trump Spox) https://twitter.com/realLizUSA >Donald J Trump Presidential Library https://www.trumplibrary.gov/ @realDonaldTrump @TeamTrump @TrumpWarRoom >b-but Trump hasnt done anything! ARCHIVED LINKS https://pastebin.com/eAhgNyeX   NEW APPEARANCES >Pres Trump Day 17 Executive Orders, Washington, DC 2/5/2025 https://rumble.com/v6hdnlv-full-speech-president-trump-signs-eos-pete-hegseth-meets-with-netanyahu-252.html (RSBN) >Pres Trump Day 16 Executive Orders, Washington, DC 2/4/2025 https://youtu.be/1hWZ8oG_x9I >Pres Trump Day 15 Executive Orders, Washington, DC 2/32025 https://youtu.be/07UH2FTaqE4 >Pres Trump Day 11 Executive Orders, Washington, DC 1/30/2025 https://youtu.be/dzJKE88gtdo >Pres Trump Roundtable, Palisades, CA 1/25/2025 https://youtu.be/DU6QiR6u_Yw >Pres Trump Day 4 Executive Orders, Washington, DC 1/23/2025 https://youtu.be/3rmWeGbfN8o >Pres Trump Remarks in Emancipation Hall, Washington, DC 1/20/2025 https://www.c-span.org/program/white-house-event/president-trump-remarks-in-emancipation-hall/654699 >Pres Trump Inaugural Address, Washington, DC 1/20/2025 https://www.c-span.org/program/white-house-event/president-donald-trump-second-inaugural-address/654692 >Pres Trump Pre-Inauguration Rally, Washington, DC 1/19/2025 https://x.com/realDonaldTrump/status/1881073769449492971 >TrumpVideo: WE WILL WIN 6/19/23 https://rumble.com/v2v6m2a >MAKE AMERICA GREAT AGAIN, AGAIN! 10/28/21 https://rumble.com/voe8gm >God Bless the USA (Donald J Trump) 10/20/16 https://youtu.be/O_PC_fy0fk0   OP pastebin: http://pastebin.com/X4KiALfh prev >>497716315",
    "link": "//boards.4chan.org/pol/thread/497722790",
    "number_of_posts": "R: 316 / I: 156▶"
  },
  {
    "title": "France loves India, the future India-France Federation will mog chinkland and muttland",
    "link": "//boards.4chan.org/pol/thread/497729098",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": "What happens when you combine quantum computers with AI?",
    "link": "//boards.4chan.org/pol/thread/497698650",
    "number_of_posts": "R: 123 / I: 13▶"
  },
  {
    "title": "I don't think violence against minorities it's good: I mean, yeah remigration and all of that, but i think violence or attacks are too far",
    "link": "//boards.4chan.org/pol/thread/497727920",
    "number_of_posts": "R: 3 / I: 1▶"
  },
  {
    "title": "No comment has ever been more prescient",
    "link": "//boards.4chan.org/pol/thread/497721795",
    "number_of_posts": "R: 72 / I: 27▶"
  },
  {
    "title": "Oh wow, who would've guessed?: https://youtu.be/SAGXa8FRq5Y",
    "link": "//boards.4chan.org/pol/thread/497725832",
    "number_of_posts": "R: 11▶"
  },
  {
    "title": "The time for talking is over.: If the elite wanted people to live a quality life, they would introduce quotas for the birth of children. 1 child per family A ban on birth at a certain time to adjust the course and number of generations. The balance would bring people to a population of 1.5-2 billion people, which would increase the planetary standard of living by 4-5 times. This way people would have houses/cars/eat quality food/have access to resources for their talents and passions. But the elite only wants a farm of mindless cattle, constantly mindlessly multiplying inside a pyramid of slaves in intense intra-social competition for basic things. Conclusion: If the elite does not want quality and goodness for the herd...then the herd should not comply with any social contracts with the elite. Eat the Rich...bon appetit.",
    "link": "//boards.4chan.org/pol/thread/497728947",
    "number_of_posts": "R: 0▶"
  },
  {
    "title": ">I voted for Milei 4 times >I supported him in everything >today, I lost 20K USD in less than 5 minutes >I always trusted in him, since 2019 I've been watching all of his interviews >there's no coming back (The last part is untranslatable for OP Aso you'll have to ask an argentinean what does that mean). TOP KEK",
    "link": "//boards.4chan.org/pol/thread/497722778",
    "number_of_posts": "R: 27 / I: 6▶"
  },
  {
    "title": "You can now reverse your age: Harvard researchers have successfully used drug combinations to reverse aging >A hallmark of eukaryotic aging is a loss of epigenetic information, a process that can be reversed. We have previously shown that the ectopic induction of the Yamanaka factors OCT4, SOX2, and KLF4 (OSK) in mammals can restore youthful DNA methylation patterns, transcript profiles, and tissue function, without erasing cellular identity, a process that requires active DNA demethylation. To screen for molecules that reverse cellular aging and rejuvenate human cells without altering the genome, we developed high-throughput cell-based assays that distinguish young from old and senescent cells, including transcription-based aging clocks and a real-time nucleocytoplasmic compartmentalization (NCC) assay. >We identify six chemical cocktails, which, in less than a week and without compromising cellular identity, restore a youthful genome-wide transcript profile and reverse transcriptomic age. Thus, rejuvenation by age reversal can be achieved, not only by genetic, but also chemical means. https://www.aging-us.com/article/204896/text",
    "link": "//boards.4chan.org/pol/thread/497693740",
    "number_of_posts": "R: 156 / I: 18▶"
  },
  {
    "title": "He wants your tax information now: Why?",
    "link": "//boards.4chan.org/pol/thread/497710326",
    "number_of_posts": "R: 101 / I: 12▶"
  },
  {
    "title": "Why do mutts on here always go like \"my great great great grandfather was from Ireland and I'm 2% irish, whiter than you muhammad\" and look like this?",
    "link": "//boards.4chan.org/pol/thread/497726911",
    "number_of_posts": "R: 13 / I: 2▶"
  },
  {
    "title": "So close yet so far: It's crazy to see lefties who are *so close* to understanding the right, but they're still so far. I saw an echo chamber thread like \"why is the entire world getting more right wing\" and obviously, most answers were what you'd expect. \"durr, its cuz they STUPID! its cuz they UNEMPATHEIC AND STUPID! and stupid people are ez to brainwash!!!\" but then you have people who give a little bit more thought than that, and they're the ones who almost get it. they say \"its because of racism\". they say the world is getting more right wing because white people are getting more and more racist against people who are different than them. and theyre so, so close to reality it is because of racism its because white peoples homes are being systematically wiped out and their families quite literally raped out of existence, and they're taken to jail if they notice it. they're completely right. the world is becoming more right-wing because of racism. because of your racism. against white people.",
    "link": "//boards.4chan.org/pol/thread/497728098",
    "number_of_posts": "R: 3▶"
  },
  {
    "title": "So the United States is just a subsidiary of Musks companies now",
    "link": "//boards.4chan.org/pol/thread/497724329",
    "number_of_posts": "R: 29 / I: 9▶"
  },
  {
    "title": "President Musk calls for putting the press in prison. Based? https://x.com/elonmusk/status/1891310595397292169",
    "link": "//boards.4chan.org/pol/thread/497716643",
    "number_of_posts": "R: 42 / I: 6▶"
  },
  {
    "title": "Baby boomers rape kids: The reason why women are mostly whores and the reason why fags and troons are everywhere can be attributed to generation ME ME ME, ie baby boomers. They raped their daughters and nieces, they raped their sons and nephews and they raped children in general. It was all about the high of doing something evil and getting away with it. It’s why they love Israel so much.",
    "link": "//boards.4chan.org/pol/thread/497728338",
    "number_of_posts": "R: 2▶"
  },
  {
    "title": "Why are people freaking out about eggs?: Make Chili or stews. Eat cold cuts for breakfast with some mustard. Eat sardines and tuna for omega threes. What is the big deal? Its like the toilet paper mania all over again.",
    "link": "//boards.4chan.org/pol/thread/497704873",
    "number_of_posts": "R: 197 / I: 31▶"
  }
]